/*
*********************************************************************************************************
*
*	模块名称 : BSP模块(For GD32E103)
*	文件名称 : bsp.c
*	版    本 : V1.0
*	说    明 : 这是硬件底层驱动程序模块的主文件。主要提供 bsp_Init()函数供主程序调用。主程序的每个c文件可以在开
*			   头添加 #include "bsp.h" 来包含所有的外设驱动模块。
*
*	修改记录 :
*		版本号  日期         作者     说明
*		V1.0    2020-05-17   FAN    正式发布
*
*********************************************************************************************************
*/
#include "bsp.h"

#define EXAMPLE_NAME	 "Smart Pet"
#define EXAMPLE_VER	     "V1.1"
#define EXAMPLE_AUTHOR	 "这次一定队"

static void PrintfLogo(void);

/*
*********************************************************************************************************
*	函 数 名: bsp_Init
*	功能说明: 初始化硬件设备。只需要调用一次。该函数配置CPU寄存器和外设的寄存器并初始化一些全局变量。
*			 全局变量。
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_Init(void)
{
//    __disable_irq();  /* 禁止全局中断*/
    bsp_InitTimer();   //定时器初始化

    bsp_GPIO();				//各个引脚初始化

    bsp_DebugInit();  //初始化调试口UART4
	
    PrintfLogo();	    //打印logo

    LCD_Init(); 			//液晶屏初始化

    bsp_usb_init();   //usb串口初始化

    rtc_process();		//rtc初始化

    uart0_init();			//串口0初始化 -> 4G模块

    lock_init();			//电磁锁初始化

		key_init();			// 初始化按键 
//    __enable_irq(); /*  使能全局中断 */
}

/*
*********************************************************************************************************
*	函 数 名: bsp_RunPer10ms
*	功能说明: 该函数每隔10ms被Systick中断调用1次。详见 bsp_timer.c的定时中断服务程序。一些处理时间要求不严格的
*			任务可以放在此函数。比如：按键扫描、蜂鸣器鸣叫控制等。
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_RunPer10ms(void)
{
				
}

/*
*********************************************************************************************************
*	函 数 名: bsp_RunPer1ms
*	功能说明: 该函数每隔1ms被Systick中断调用1次。详见 bsp_timer.c的定时中断服务程序。一些需要周期性处理的事务
*			 可以放在此函数。比如：触摸坐标扫描。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_RunPer1ms(void)
{
	
}

/*
*********************************************************************************************************
*	函 数 名: bsp_Idle
*	功能说明: 空闲时执行的函数。一般主程序在for和while循环程序体中需要插入 CPU_IDLE() 宏来调用本函数。
*			 本函数缺省为空操作。用户可以添加喂狗、设置CPU进入休眠模式的功能。
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_Idle(void)
{
	/* --- 喂狗 */

	/* --- 让CPU进入休眠，由Systick定时中断唤醒或者其他中断唤醒 */

	/* 例如 emWin 图形库，可以插入图形库需要的轮询函数 */
	//GUI_Exec();

	/* 例如 uIP 协议，可以插入uip轮询函数 */
}



void PrintfLogo(void)
{
  Debug_Printf("\r\n*************************************************************\r\n");
	
  Debug_Printf("* Name    :     %s\r\n", EXAMPLE_NAME);	
  Debug_Printf("* Version :     %s\r\n", EXAMPLE_VER);		
  Debug_Printf("* Author  :     %s\r\n", EXAMPLE_AUTHOR);

  Debug_Printf("*************************************************************\r\n\r\n");

/* 检测CPU ID */
	{
		/* 参考手册：
			32.6.1 MCU device ID code
			33.1 Unique device ID register (96 bits)
		*/
		uint32_t CPU_Sn0, CPU_Sn1, CPU_Sn2;

		CPU_Sn0 = *(__IO uint32_t*)(0x1FFFF7E8);
		CPU_Sn1 = *(__IO uint32_t*)(0x1FFFF7EC);
		CPU_Sn2 = *(__IO uint32_t*)(0x1FFFF7F0);

		Debug_Printf("\r\nCPU : GD32E103RBT6, LQFP64, 主频: %dMHz\r\n", SystemCoreClock / 1000000);
		Debug_Printf("UID = %08X %08X %08X\n\r", CPU_Sn2, CPU_Sn1, CPU_Sn0);
	}

	Debug_Printf("\n\r");

	/* 打印ST固件库版本 */
	Debug_Printf("* 固件库版本 : V%d.%d.%d (GD32E10x firmware library version )\r\n", __GD32E10x_STDPERIPH_VERSION_MAIN,
			__GD32E10x_STDPERIPH_VERSION_SUB1,__GD32E10x_STDPERIPH_VERSION_SUB2);
	Debug_Printf("* \r\n");	/* 打印一行空格 */
	Debug_Printf("* QQ    : 15307505 \r\n");
	Debug_Printf("* Email : 20191219087@nuist.edu.cn \r\n");
    Debug_Printf("* 南京信息工程大学 无锡研究生院 \r\n");
	Debug_Printf("*************************************************************\n\r");

}
	
